artillery.yml
config:
  target: "https://giftzy.click"
  phases:
    - duration: 1
      arrivalCount: 100
      name: "100 users visit once"
  http:
    timeout: 30
  defaults:
    headers:
      User-Agent: "artillery-ci-task"

scenarios:
  - name: "Visit home page once"
    flow:
      - get:
          url: "/"